Merge pull request #156 from basictech01/docs/update
docs: docs update with latest codebase and proper managable format
